---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile
source: html/da2078eb-09b0-19e2-e95f-f8f3b2f29554.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile

Defines parameters for L profile structural section.

## Syntax (C#)
```csharp
public class StructuralSectionLProfile : StructuralSectionGeneralLA
```